def Intface(i:str):
    match i:
        case "Welcome":
            print('---------------------------------------------')
            print('Калькулятор')
        case "Menu":
            print('---------------------------------------------')
            print('Варианты:')
            print('1. Рациональные числа')
            print('2. Комплексные числа')
            print('3. Логирование')
            print('4. Выход')
        case "End":
            print('----------------------------------------------')
            print('Выберите дальнейшее действие')
            print('1. Выход в главное меню')
            print('2. Выход из программы')
